const NUMERATOR     = 0; // числитель
const DENOMINATOR   = 1; // знаменатель

/**
 * Дни недели
 */
const MONDAY    = 1;
const TUESDAY   = 2;
const WEDNESDAY = 3;
const THURSDAY  = 4;
const FRIDAY    = 5;
const SATURDAY  = 6;

/**
 * Пары
 */
const FIRST     = 1;
const SECOND    = 2;
const THIRD     = 3;
const FOURTH    = 4;
const FIFTH     = 5;

/**
 * Длительность пар
 */
const PAIR_TIME = {
    [FIRST]: {from: '08:30', to: '10:00'},
    [SECOND]: {from: '10:10', to: '11:40'},
    [THIRD]: {from: '12:00', to: '13:30'},
    [FOURTH]: {from: '14:30', to: '16:00'},
    [FIFTH]: {from: '16:10', to: '17:40'},
};

/**
 * Период расписания
 */
var startDate = '2017-01-23';
var endDate = '2017-06-01';

/**
 * Сетка расписания
 */
var schedule = {
    [NUMERATOR]: {
        [MONDAY]: {
            [SECOND]: 'Физ-ра',
            [THIRD]: 'Безопасность в ЧС (л) 120А',
            [FOURTH]: 'Безопасность в ЧС (пр) 120А',
        },
        [TUESDAY]: {
            [FIRST]: 'Спец. оценка условий труда (л) 120А',
            [SECOND]: 'Спец. оценка условий труда (л/р) 119А',
            [THIRD]: 'Электроника и электротехника (л) 503Б',
        },
        [WEDNESDAY]: {
            [SECOND]: 'Произв. санитария и гигиена труда (л) 120А',
            [THIRD]: 'Физ-ра',
            [FOURTH]: 'Произв. санитария и гигиена труда (пр) 120А',
        },
        [THURSDAY]: {
            [SECOND]: 'Управление техносферной безопасностью (л) 120А',
            [THIRD]: 'Управление техносферной безопасностью (пр) 120А',
            [FOURTH]: 'Произв. санитария и гигиена труда (л/р) 119А',
        },
        [FRIDAY]: {
            [FIRST]: 'Электроника и электротехника (пр) 303Б',
            [SECOND]: 'Разраб. и экспл. нефт./газ. месторождений (л) 314А',
        },
    },
    [DENOMINATOR]: {
        [MONDAY]: {
            [SECOND]: 'Физ-ра',
            [THIRD]: 'Безопасность в ЧС (л) 120А',
            [FOURTH]: 'Безопасность в ЧС (л/р) 119А',
        },
        [TUESDAY]: {
            [SECOND]: 'Электроника и электротехника (л/р) 205А',
            [THIRD]: 'Электроника и электротехника (л) 503Б',
        },
        [WEDNESDAY]: {
            [SECOND]: 'Произв. санитария и гигиена труда (л) 120А',
            [THIRD]: 'Физ-ра',
            [FOURTH]: 'Произв. санитария и гигиена труда (пр) 120А',
        },
        [THURSDAY]: {
            [SECOND]: 'Управление техносферной безопасностью (пр) 120А',
            [THIRD]: 'Спец. оценка условий труда (пр) 120А',
            [FOURTH]: 'Произв. санитария и гигиена труда (л/р) 119А',
        },
        [FRIDAY]: {
            [SECOND]: 'Разраб. и экспл. нефт./газ. месторождений (пр) 314А',
            [THIRD]: 'Разраб. и экспл. нефт./газ. месторождений (л/р) 220А',
        },
    },
};